In [68]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as dt

In [69]:
uber = pd.read_csv("uber_drive_2016.csv")

In [70]:
uber.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [71]:
uber.rename({'START_DATE*':'start_date','END_DATE*':'end_date','CATEGORY*':'category',
            'START*':'start','STOP*':'stop','MILES*':'miles','PURPOSE*':'purpose'}, axis=1,inplace=True)

In [72]:
uber.head()

,start_date,end_date,category,start,stop,miles,purpose
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [73]:
uber.isna().sum()

start_date      0
end_date        1
category        1
start           1
stop            1
miles           0
purpose       503
dtype: int64

In [74]:
uber.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1156 entries, 0 to 1155
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   start_date  1156 non-null   object
 1   end_date    1155 non-null   object
 2   category    1155 non-null   object
 3   start       1155 non-null   object
 4   stop        1155 non-null   object
 5   miles       1156 non-null   float64
 6   purpose     653 non-null    object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

In [75]:
uber.tail()

,start_date,end_date,category,start,stop,miles,purpose
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [76]:
uber[uber['start_date'] == 'Totals']

     start_date end_date category start stop    miles purpose
1155     Totals      NaN      NaN   NaN  NaN  12204.7     NaN

In [77]:
uber.drop(uber[uber['start_date'] == 'Totals'].index,inplace=True)

In [78]:
uber.tail()

,start_date,end_date,category,start,stop,miles,purpose
1150,12/31/2016 1:07,12/31/2016 1:14,Business,Kar?chi,Kar?chi,0.7,Meeting
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site

In [79]:
uber['START_DATE'] = uber['start_date'].str.split(' ').str.get(0)
uber['END_DATE'] = uber['end_date'].str.split(' ').str.get(0)

In [80]:
uber.head()

,start_date,end_date,category,start,stop,miles,purpose,START_DATE,END_DATE
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,1/1/2016,1/1/2016
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN,1/2/2016,1/2/2016
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,1/2/2016,1/2/2016
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting,1/5/2016,1/5/2016
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,1/6/2016,1/6/2016

In [81]:
uber['START_DATE_AND_TIME'] = pd.to_datetime(uber['start_date'])

In [82]:
uber['END_DATE_AND_TIME'] = pd.to_datetime(uber['end_date'])
uber.tail()

,start_date,end_date,category,start,stop,miles,purpose,START_DATE,END_DATE,START_DATE_AND_TIME,END_DATE_AND_TIME
1150,12/31/2016 1:07,12/31/2016 1:14,Business,Kar?chi,Kar?chi,0.7,Meeting,12/31/2016,12/31/2016,2016-12-31 01:07:00,2016-12-31 01:14:00
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site,12/31/2016,12/31/2016,2016-12-31 13:24:00,2016-12-31 13:42:00
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting,12/31/2016,12/31/2016,2016-12-31 15:03:00,2016-12-31 15:38:00
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site,12/31/2016,12/31/2016,2016-12-31 21:32:00,2016-12-31 21:50:00
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site,12/31/2016,12/31/2016,2016-12-31 22:08:00,2016-12-31 23:51:00

In [83]:
uber.drop(['start_date','end_date'], axis=1, inplace=True)

In [84]:
uber.head()

,category,start,stop,miles,purpose,START_DATE,END_DATE,START_DATE_AND_TIME,END_DATE_AND_TIME
0,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,1/1/2016,1/1/2016,2016-01-01 21:11:00,2016-01-01 21:17:00
1,Business,Fort Pierce,Fort Pierce,5.0,NaN,1/2/2016,1/2/2016,2016-01-02 01:25:00,2016-01-02 01:37:00
2,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,1/2/2016,1/2/2016,2016-01-02 20:25:00,2016-01-02 20:38:00
3,Business,Fort Pierce,Fort Pierce,4.7,Meeting,1/5/2016,1/5/2016,2016-01-05 17:31:00,2016-01-05 17:45:00
4,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,1/6/2016,1/6/2016,2016-01-06 14:42:00,2016-01-06 15:49:00

In [85]:
uber.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1155 entries, 0 to 1154
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   category             1155 non-null   object
 1   start                1155 non-null   object
 2   stop                 1155 non-null   object
 3   miles                1155 non-null   float64
 4   purpose              653 non-null    object
 5   START_DATE           1155 non-null   object
 6   END_DATE             1155 non-null   object
 7   START_DATE_AND_TIME  1155 non-null   datetime64[ns]
 8   END_DATE_AND_TIME    1155 non-null   datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(6)
memory usage: 90.2+ KB

In [86]:
uber['START_DATE'] =  pd.to_datetime(uber['START_DATE'], format='%m/%d/%Y')

In [87]:
uber['END_DATE'] = pd.to_datetime(uber['END_DATE'], format='%m/%d/%Y')

In [88]:
uber.head()

,category,start,stop,miles,purpose,START_DATE,END_DATE,START_DATE_AND_TIME,END_DATE_AND_TIME
0,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,2016-01-01,2016-01-01,2016-01-01 21:11:00,2016-01-01 21:17:00
1,Business,Fort Pierce,Fort Pierce,5.0,NaN,2016-01-02,2016-01-02,2016-01-02 01:25:00,2016-01-02 01:37:00
2,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,2016-01-02,2016-01-02,2016-01-02 20:25:00,2016-01-02 20:38:00
3,Business,Fort Pierce,Fort Pierce,4.7,Meeting,2016-01-05,2016-01-05,2016-01-05 17:31:00,2016-01-05 17:45:00
4,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,2016-01-06,2016-01-06,2016-01-06 14:42:00,2016-01-06 15:49:00

In [89]:
uber['duration'] = uber['END_DATE_AND_TIME'] - uber['START_DATE_AND_TIME']
uber.head()

,category,start,stop,miles,purpose,START_DATE,END_DATE,START_DATE_AND_TIME,END_DATE_AND_TIME,duration
0,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,2016-01-01,2016-01-01,2016-01-01 21:11:00,2016-01-01 21:17:00,0 days 00:06:00
1,Business,Fort Pierce,Fort Pierce,5.0,NaN,2016-01-02,2016-01-02,2016-01-02 01:25:00,2016-01-02 01:37:00,0 days 00:12:00
2,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,2016-01-02,2016-01-02,2016-01-02 20:25:00,2016-01-02 20:38:00,0 days 00:13:00
3,Business,Fort Pierce,Fort Pierce,4.7,Meeting,2016-01-05,2016-01-05,2016-01-05 17:31:00,2016-01-05 17:45:00,0 days 00:14:00
4,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,2016-01-06,2016-01-06,2016-01-06 14:42:00,2016-01-06 15:49:00,0 days 01:07:00

In [90]:
uber['duration'] = uber['duration'].dt.total_seconds()/60

In [91]:
uber['START_DAY'] = uber['START_DATE'].dt.day_name()

In [92]:
uber['END_DAY'] = uber['END_DATE'].dt.day_name()

In [93]:
uber['MONTH'] = uber['START_DATE'].dt.strftime('%B')

In [94]:
uber.head()

,category,start,stop,miles,purpose,START_DATE,END_DATE,START_DATE_AND_TIME,END_DATE_AND_TIME,duration,START_DAY,END_DAY,MONTH
0,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,2016-01-01,2016-01-01,2016-01-01 21:11:00,2016-01-01 21:17:00,6.0,Friday,Friday,January
1,Business,Fort Pierce,Fort Pierce,5.0,NaN,2016-01-02,2016-01-02,2016-01-02 01:25:00,2016-01-02 01:37:00,12.0,Saturday,Saturday,January
2,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,2016-01-02,2016-01-02,2016-01-02 20:25:00,2016-01-02 20:38:00,13.0,Saturday,Saturday,January
3,Business,Fort Pierce,Fort Pierce,4.7,Meeting,2016-01-05,2016-01-05,2016-01-05 17:31:00,2016-01-05 17:45:00,14.0,Tuesday,Tuesday,January
4,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,2016-01-06,2016-01-06,2016-01-06 14:42:00,2016-01-06 15:49:00,67.0,Wednesday,Wednesday,January

In [95]:
uber.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1155 entries, 0 to 1154
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   category             1155 non-null   object
 1   start                1155 non-null   object
 2   stop                 1155 non-null   object
 3   miles                1155 non-null   float64
 4   purpose              653 non-null    object
 5   START_DATE           1155 non-null   datetime64[ns]
 6   END_DATE             1155 non-null   datetime64[ns]
 7   START_DATE_AND_TIME  1155 non-null   datetime64[ns]
 8   END_DATE_AND_TIME    1155 non-null   datetime64[ns]
 9   duration             1155 non-null   float64
 10  START_DAY            1155 non-null   object
 11  END_DAY              1155 non-null   object
 12  MONTH                1155 non-null   object
dtypes: datetime64[ns](4), float64(2), object(7)
memory usage: 126.3+ KB

In [97]:
uber.pivot_table(index='purpose',values=['miles','duration']).sort_values(by='duration', ascending=False)

                   duration       miles
purpose
Commute          185.000000  180.200000
Customer Visit    33.415842   20.688119
Meeting           29.737968   15.247594
Charity ($)       27.000000   15.100000
Airport/Travel    26.000000    5.500000
Temporary Site    25.860000   10.474000
Between Offices   25.500000   10.944444
Meal/Entertain    16.125000    5.698125
Moving            15.000000    4.550000
Errand/Supplies   12.976562    3.968750

In [103]:
uber.pivot_table(index='purpose',values=['miles','duration'],aggfunc=['count','median','std'])

                   count         median                std
                duration miles duration   miles   duration      miles
Airport/Travel         3     3     29.0    4.80   9.848858   1.852026
Between Offices       18    18     23.0   11.60  15.553513   8.458913
Charity ($)            1     1     27.0   15.10        NaN        NaN
Commute                1     1    185.0  180.20        NaN        NaN
Customer Visit       101   101     21.0    7.90  42.891087  40.632891
Errand/Supplies      128   128     10.0    3.10   9.656677   3.464619
Meal/Entertain       160   160     13.5    4.25  10.477739   5.019690
Meeting              187   187     22.0   10.00  26.662381  25.093394
Moving                 4     4     14.0    4.40   4.546061   1.181807
Temporary Site        50    50     20.0    8.00  18.233195   7.757440